#Тест про крысу
"""
col=0
a=(str(input("Введите своё имя: ")))
print("Привет",a )
print("Это тест про крыу")
print("Вопрос первый.Самая жирная крыса?Ты,Дамбо,Venom")
otvet1="Ты"
c=input("Ответ: ")
if c==otvet1:
    print("Верно")
    col+=1
else:
    print("Не верно")
print("Вопрос второй.Самая милая крыса?Куцицельга,Чупичупичаппача,Ваня")
otvet2="Чупичупичаппача"
c=input("Ответ: ")
if c==otvet2:
    print("Верно")
    col+=1
else:
    print("Не верно")
print("Вопрос третий.Самая мемная крыса?Психическая крыса,Компьютерная,Блум")
otvet3="Блум"
c=input("Ответ: ")
if c==otvet3:
    print("Верно")
    col+=1
else:
    print("Не верно")
print("Вы ответили верно: ",col ,"раз")
"""

#Задача 1
"""
a="Amogus"
col=0
for vowel in "Amogus":
    col +=a.count(vowel)
print(vowel)
"""


#Задача 2
"""
a=int(input())
b=0
while b!=10:
    b+=1
    c=a*b
    print(str(c))
"""

#Задача 3
"""
a=str(input())
b=len(a)
i=0
b=b-1
n=0
while b-i>=i:
    if a[-i]==a[i]:
        i+=1
    else:
            n=1
            break
    if n==1:
        print("no")
    else:
        print("yes")
"""
       
